#+TITLE: 08.org
#+AUTHOR: Jeong Hoon Choi
#+DATE: 2024.02.09

* Deep CNN models
** VGGNet
#+begin_src python :results output

import tensorflow as tf
from tensorflow import keras
from tensorflow.keras.utils import to_categorical
from tensorflow.keras.models import Sequential
from tensorflow.keras.layers import Input, Conv2D, MaxPool2D, Flatten, Dense
import numpy as np
import logging

tf.get_logger().setLevel(logging.ERROR)

model=Sequential()
# 1
model.add(Conv2D(64, (3, 3), strides=(1, 1),
                 input_shape=(32, 32, 3),
                 padding="same", activation="relu"))
model.add(Conv2D(64, (3, 3), strides=(1, 1),
                 padding="same", activation="relu"))
model.add(MaxPool2D(pool_size=(2, 2), strides=2))
# 2
model.add(Conv2D(128, (3, 3), strides=(1, 1),
                 padding="same", activation="relu"))
model.add(Conv2D(128, (3, 3), strides=(1, 1),
                 padding="same", activation="relu"))
model.add(MaxPool2D(pool_size=(2, 2), strides=2))
# 3
model.add(Conv2D(256, (3, 3), strides=(1, 1),
                 padding="same", activation="relu"))
model.add(Conv2D(256, (3, 3), strides=(1, 1),
                 padding="same", activation="relu"))
model.add(Conv2D(256, (1, 1), strides=(1, 1),
                 padding="same", activation="relu"))
model.add(MaxPool2D(pool_size=(2, 2), strides=2))
# 4
model.add(Conv2D(512, (3, 3), strides=(1, 1),
                 padding="same", activation="relu"))
model.add(Conv2D(512, (3, 3), strides=(1, 1),
                 padding="same", activation="relu"))
model.add(Conv2D(512, (1, 1), strides=(1, 1),
                 padding="same", activation="relu"))
model.add(MaxPool2D(pool_size=(2, 2), strides=2))
# 5
model.add(Conv2D(512, (3, 3), strides=(1, 1),
                 padding="same", activation="relu"))
model.add(Conv2D(512, (3, 3), strides=(1, 1),
                 padding="same", activation="relu"))
model.add(Conv2D(512, (1, 1), strides=(1, 1),
                 padding="same", activation="relu"))
model.add(MaxPool2D(pool_size=(2, 2), strides=2))

model.add(Flatten())
model.add(Dense(4096, activation="relu"))
model.add(Dense(4096, activation="relu"))
model.add(Dense(1000, activation="softmax"))

model.compile(loss="categorical_crossentropy", optimizer="adam",
              metrics=["accuracy"])

model.summary()

#+end_src

#+RESULTS:
#+begin_example
Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 conv2d (Conv2D)             (None, 32, 32, 64)        1792      
                                                                 
 conv2d_1 (Conv2D)           (None, 32, 32, 64)        36928     
                                                                 
 max_pooling2d (MaxPooling2  (None, 16, 16, 64)        0         
 D)                                                              
                                                                 
 conv2d_2 (Conv2D)           (None, 16, 16, 128)       73856     
                                                                 
 conv2d_3 (Conv2D)           (None, 16, 16, 128)       147584    
                                                                 
 max_pooling2d_1 (MaxPoolin  (None, 8, 8, 128)         0         
 g2D)                                                            
                                                                 
 conv2d_4 (Conv2D)           (None, 8, 8, 256)         295168    
                                                                 
 conv2d_5 (Conv2D)           (None, 8, 8, 256)         590080    
                                                                 
 conv2d_6 (Conv2D)           (None, 8, 8, 256)         65792     
                                                                 
 max_pooling2d_2 (MaxPoolin  (None, 4, 4, 256)         0         
 g2D)                                                            
                                                                 
 conv2d_7 (Conv2D)           (None, 4, 4, 512)         1180160   
                                                                 
 conv2d_8 (Conv2D)           (None, 4, 4, 512)         2359808   
                                                                 
 conv2d_9 (Conv2D)           (None, 4, 4, 512)         262656    
                                                                 
 max_pooling2d_3 (MaxPoolin  (None, 2, 2, 512)         0         
 g2D)                                                            
                                                                 
 conv2d_10 (Conv2D)          (None, 2, 2, 512)         2359808   
                                                                 
 conv2d_11 (Conv2D)          (None, 2, 2, 512)         2359808   
                                                                 
 conv2d_12 (Conv2D)          (None, 2, 2, 512)         262656    
                                                                 
 max_pooling2d_4 (MaxPoolin  (None, 1, 1, 512)         0         
 g2D)                                                            
                                                                 
 flatten (Flatten)           (None, 512)               0         
                                                                 
 dense (Dense)               (None, 4096)              2101248   
                                                                 
 dense_1 (Dense)             (None, 4096)              16781312  
                                                                 
 dense_2 (Dense)             (None, 1000)              4097000   
                                                                 
=================================================================
Total params: 32975656 (125.79 MB)
Trainable params: 32975656 (125.79 MB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________
#+end_example

** GoogLeNet
- Naïve Inception Module
#+begin_src python :results output

import tensorflow as tf
from tensorflow import keras
from tensorflow.keras import Model
from tensorflow.keras.utils import to_categorical
from tensorflow.keras.layers import Input, Conv2D, MaxPool2D, Flatten, Dense, Concatenate
import logging

tf.get_logger().setLevel(logging.ERROR)

def inception_module(inputs):
    branch1=Conv2D(2, (1, 1),
                   strides=(1, 1), padding="same",
                   activation="relu",
                   kernel_initializer="he_normal")(inputs)
    branch2=Conv2D(4, (3, 3),
                   strides=(1, 1), padding="same",
                   activation="relu",
                   kernel_initializer="he_normal")(inputs)
    branch3=Conv2D(2, (5, 5),
                   strides=(1, 1), padding="same",
                   activation="relu",
                   kernel_initializer="he_normal")(inputs)
    branch4=MaxPool2D(pool_size=(3, 3), strides=(1, 1), padding="same")(inputs)
    inception=Concatenate(axis=-1)([branch1, branch2, branch3, branch4])
    return inception

def reduced_inception_module(inputs):
    # 1
    branch1=Conv2D(2, (1, 1),
                   strides=(1, 1), padding="same",
                   activation="relu",
                   kernel_initializer="he_normal")(inputs)
    # 2
    branch2=Conv2D(2, (1, 1),
                   strides=(1, 1), padding="same",
                   activation="relu",
                   kernel_initializer="he_normal")(inputs)
    branch2=Conv2D(4, (3, 3),
                   strides=(1, 1), padding="same",
                   activation="relu",
                   kernel_initializer="he_normal")(branch2)
    # 3
    branch3=Conv2D(1, (1, 1),
                   strides=(1, 1), padding="same",
                   activation="relu",
                   kernel_initializer="he_normal")(inputs)
    branch3=Conv2D(2, (5, 5),
                   strides=(1, 1), padding="same",
                   activation="relu",
                   kernel_initializer="he_normal")(branch3)
    # 4
    branch4=MaxPool2D(pool_size=(3, 3), strides=(1, 1), padding="same")(inputs)
    branch4=Conv2D(2, (1, 1),
                   strides=(1, 1), padding="same",
                   activation="relu",
                   kernel_initializer="he_normal")(branch4)
    inception=Concatenate(axis=-1)([branch1, branch2, branch3, branch4])
    return inception
    
    

if __name__ == "__main__":
    input=Input(shape=(32, 32, 3))
    output1=inception_module(input)
    output2=reduced_inception_module(input)

    model1=Model(input, output1, name="inception")
    model2=Model(input, output2, name="reduced_inception")

    model1.summary()
    model2.summary()
    
#+end_src

#+RESULTS:
#+begin_example
Model: "inception"
__________________________________________________________________________________________________
 Layer (type)                Output Shape                 Param #   Connected to                  
==================================================================================================
 input_1 (InputLayer)        [(None, 32, 32, 3)]          0         []                            
                                                                                                  
 conv2d (Conv2D)             (None, 32, 32, 2)            8         ['input_1[0][0]']             
                                                                                                  
 conv2d_1 (Conv2D)           (None, 32, 32, 4)            112       ['input_1[0][0]']             
                                                                                                  
 conv2d_2 (Conv2D)           (None, 32, 32, 2)            152       ['input_1[0][0]']             
                                                                                                  
 max_pooling2d (MaxPooling2  (None, 32, 32, 3)            0         ['input_1[0][0]']             
 D)                                                                                               
                                                                                                  
 concatenate (Concatenate)   (None, 32, 32, 11)           0         ['conv2d[0][0]',              
                                                                     'conv2d_1[0][0]',            
                                                                     'conv2d_2[0][0]',            
                                                                     'max_pooling2d[0][0]']       
                                                                                                  
==================================================================================================
Total params: 272 (1.06 KB)
Trainable params: 272 (1.06 KB)
Non-trainable params: 0 (0.00 Byte)
__________________________________________________________________________________________________
Model: "reduced_inception"
__________________________________________________________________________________________________
 Layer (type)                Output Shape                 Param #   Connected to                  
==================================================================================================
 input_1 (InputLayer)        [(None, 32, 32, 3)]          0         []                            
                                                                                                  
 conv2d_4 (Conv2D)           (None, 32, 32, 2)            8         ['input_1[0][0]']             
                                                                                                  
 conv2d_6 (Conv2D)           (None, 32, 32, 1)            4         ['input_1[0][0]']             
                                                                                                  
 max_pooling2d_1 (MaxPoolin  (None, 32, 32, 3)            0         ['input_1[0][0]']             
 g2D)                                                                                             
                                                                                                  
 conv2d_3 (Conv2D)           (None, 32, 32, 2)            8         ['input_1[0][0]']             
                                                                                                  
 conv2d_5 (Conv2D)           (None, 32, 32, 4)            76        ['conv2d_4[0][0]']            
                                                                                                  
 conv2d_7 (Conv2D)           (None, 32, 32, 2)            52        ['conv2d_6[0][0]']            
                                                                                                  
 conv2d_8 (Conv2D)           (None, 32, 32, 2)            8         ['max_pooling2d_1[0][0]']     
                                                                                                  
 concatenate_1 (Concatenate  (None, 32, 32, 10)           0         ['conv2d_3[0][0]',            
 )                                                                   'conv2d_5[0][0]',            
                                                                     'conv2d_7[0][0]',            
                                                                     'conv2d_8[0][0]']            
                                                                                                  
==================================================================================================
Total params: 156 (624.00 Byte)
Trainable params: 156 (624.00 Byte)
Non-trainable params: 0 (0.00 Byte)
__________________________________________________________________________________________________
#+end_example

*** GoogLeNet
#+begin_src python :results output

import tensorflow as tf
from tensorflow.keras import Model
from tensorflow.keras.layers import Input, Conv2D, MaxPool2D, AvgPool2D, Flatten, Dense, Concatenate, Dropout
import numpy as np

def inception_module(inputs, channels):
    assert(len(channels)==6)
    # 1
    branch1=Conv2D(channels[0], (1, 1),
                   strides=(1, 1), padding="same",
                   activation="relu")(inputs)
    # 2
    branch2=Conv2D(channels[1], (1, 1),
                   strides=(1, 1), padding="same",
                   activation="relu")(inputs)
    branch2=Conv2D(channels[2], (3, 3),
                   strides=(1, 1), padding="same",
                   activation="relu")(branch2)
    # 3
    branch3=Conv2D(channels[3], (1, 1),
                   strides=(1, 1), padding="same",
                   activation="relu")(inputs)
    branch3=Conv2D(channels[4], (5, 5),
                   strides=(1, 1), padding="same",
                   activation="relu")(branch3)
    # 4
    branch4=MaxPool2D(pool_size=(3, 3), strides=(1, 1), padding="same")(inputs)
    branch4=Conv2D(channels[5], (1, 1),
                   strides=(1, 1), padding="same",
                   activation="relu")(branch4)
    inception=Concatenate(axis=-1)([branch1, branch2, branch3, branch4])
    return inception
    
if __name__ == "__main__":
    input=Input(shape=(224, 224, 3))
    x=Conv2D(64, (7, 7),
             strides=(2, 2), padding="same",
             activation="relu")(input)
    x=MaxPool2D(pool_size=(3, 3), strides=(2, 2), padding="same")(x)
    x=Conv2D(64, (1, 1),
             strides=(1, 1), padding="same",
             activation="relu")(x)
    x=Conv2D(192, (3, 3),
             strides=(1, 1), padding="same",
             activation="relu")(x)
    x=MaxPool2D(pool_size=(3, 3), strides=(2, 2), padding="same")(x)
    x=inception_module(x, [64, 96, 128, 16, 32, 32])
    x=inception_module(x, [128, 128, 192, 32, 96, 64])
    x=MaxPool2D(pool_size=(3, 3), strides=(2, 2), padding="same")(x)
    x=inception_module(x, [192, 96, 208, 16, 48, 64])
    x=inception_module(x, [160, 112, 224, 24, 64, 64])
    x=inception_module(x, [128, 128, 256, 24, 64, 64])
    x=inception_module(x, [112, 144, 320, 32, 64, 64])
    x=inception_module(x, [256, 160, 320, 32, 128, 128])
    x=MaxPool2D(pool_size=(3, 3), strides=(2, 2), padding="same")(x)
    x=inception_module(x, [256, 160, 320, 32, 128, 128])
    x=inception_module(x, [384, 192, 384, 48, 128, 128])
    x=AvgPool2D(pool_size=(7, 7), strides=(7, 7), padding="same")(x)
    x=Flatten()(x)
    x=Dropout(0.4)(x)
    output=Dense(1000, activation="softmax",
                 kernel_initializer="glorot_uniform",
                 bias_initializer="zeros")(x)

    model=Model(input, output, name="GoogLeNet")
    model.summary()
    
#+end_src

#+RESULTS:
#+begin_example
Model: "GoogLeNet"
__________________________________________________________________________________________________
 Layer (type)                Output Shape                 Param #   Connected to                  
==================================================================================================
 input_1 (InputLayer)        [(None, 224, 224, 3)]        0         []                            
                                                                                                  
 conv2d (Conv2D)             (None, 112, 112, 64)         9472      ['input_1[0][0]']             
                                                                                                  
 max_pooling2d (MaxPooling2  (None, 56, 56, 64)           0         ['conv2d[0][0]']              
 D)                                                                                               
                                                                                                  
 conv2d_1 (Conv2D)           (None, 56, 56, 64)           4160      ['max_pooling2d[0][0]']       
                                                                                                  
 conv2d_2 (Conv2D)           (None, 56, 56, 192)          110784    ['conv2d_1[0][0]']            
                                                                                                  
 max_pooling2d_1 (MaxPoolin  (None, 28, 28, 192)          0         ['conv2d_2[0][0]']            
 g2D)                                                                                             
                                                                                                  
 conv2d_4 (Conv2D)           (None, 28, 28, 96)           18528     ['max_pooling2d_1[0][0]']     
                                                                                                  
 conv2d_6 (Conv2D)           (None, 28, 28, 16)           3088      ['max_pooling2d_1[0][0]']     
                                                                                                  
 max_pooling2d_2 (MaxPoolin  (None, 28, 28, 192)          0         ['max_pooling2d_1[0][0]']     
 g2D)                                                                                             
                                                                                                  
 conv2d_3 (Conv2D)           (None, 28, 28, 64)           12352     ['max_pooling2d_1[0][0]']     
                                                                                                  
 conv2d_5 (Conv2D)           (None, 28, 28, 128)          110720    ['conv2d_4[0][0]']            
                                                                                                  
 conv2d_7 (Conv2D)           (None, 28, 28, 32)           12832     ['conv2d_6[0][0]']            
                                                                                                  
 conv2d_8 (Conv2D)           (None, 28, 28, 32)           6176      ['max_pooling2d_2[0][0]']     
                                                                                                  
 concatenate (Concatenate)   (None, 28, 28, 256)          0         ['conv2d_3[0][0]',            
                                                                     'conv2d_5[0][0]',            
                                                                     'conv2d_7[0][0]',            
                                                                     'conv2d_8[0][0]']            
                                                                                                  
 conv2d_10 (Conv2D)          (None, 28, 28, 128)          32896     ['concatenate[0][0]']         
                                                                                                  
 conv2d_12 (Conv2D)          (None, 28, 28, 32)           8224      ['concatenate[0][0]']         
                                                                                                  
 max_pooling2d_3 (MaxPoolin  (None, 28, 28, 256)          0         ['concatenate[0][0]']         
 g2D)                                                                                             
                                                                                                  
 conv2d_9 (Conv2D)           (None, 28, 28, 128)          32896     ['concatenate[0][0]']         
                                                                                                  
 conv2d_11 (Conv2D)          (None, 28, 28, 192)          221376    ['conv2d_10[0][0]']           
                                                                                                  
 conv2d_13 (Conv2D)          (None, 28, 28, 96)           76896     ['conv2d_12[0][0]']           
                                                                                                  
 conv2d_14 (Conv2D)          (None, 28, 28, 64)           16448     ['max_pooling2d_3[0][0]']     
                                                                                                  
 concatenate_1 (Concatenate  (None, 28, 28, 480)          0         ['conv2d_9[0][0]',            
 )                                                                   'conv2d_11[0][0]',           
                                                                     'conv2d_13[0][0]',           
                                                                     'conv2d_14[0][0]']           
                                                                                                  
 max_pooling2d_4 (MaxPoolin  (None, 14, 14, 480)          0         ['concatenate_1[0][0]']       
 g2D)                                                                                             
                                                                                                  
 conv2d_16 (Conv2D)          (None, 14, 14, 96)           46176     ['max_pooling2d_4[0][0]']     
                                                                                                  
 conv2d_18 (Conv2D)          (None, 14, 14, 16)           7696      ['max_pooling2d_4[0][0]']     
                                                                                                  
 max_pooling2d_5 (MaxPoolin  (None, 14, 14, 480)          0         ['max_pooling2d_4[0][0]']     
 g2D)                                                                                             
                                                                                                  
 conv2d_15 (Conv2D)          (None, 14, 14, 192)          92352     ['max_pooling2d_4[0][0]']     
                                                                                                  
 conv2d_17 (Conv2D)          (None, 14, 14, 208)          179920    ['conv2d_16[0][0]']           
                                                                                                  
 conv2d_19 (Conv2D)          (None, 14, 14, 48)           19248     ['conv2d_18[0][0]']           
                                                                                                  
 conv2d_20 (Conv2D)          (None, 14, 14, 64)           30784     ['max_pooling2d_5[0][0]']     
                                                                                                  
 concatenate_2 (Concatenate  (None, 14, 14, 512)          0         ['conv2d_15[0][0]',           
 )                                                                   'conv2d_17[0][0]',           
                                                                     'conv2d_19[0][0]',           
                                                                     'conv2d_20[0][0]']           
                                                                                                  
 conv2d_22 (Conv2D)          (None, 14, 14, 112)          57456     ['concatenate_2[0][0]']       
                                                                                                  
 conv2d_24 (Conv2D)          (None, 14, 14, 24)           12312     ['concatenate_2[0][0]']       
                                                                                                  
 max_pooling2d_6 (MaxPoolin  (None, 14, 14, 512)          0         ['concatenate_2[0][0]']       
 g2D)                                                                                             
                                                                                                  
 conv2d_21 (Conv2D)          (None, 14, 14, 160)          82080     ['concatenate_2[0][0]']       
                                                                                                  
 conv2d_23 (Conv2D)          (None, 14, 14, 224)          226016    ['conv2d_22[0][0]']           
                                                                                                  
 conv2d_25 (Conv2D)          (None, 14, 14, 64)           38464     ['conv2d_24[0][0]']           
                                                                                                  
 conv2d_26 (Conv2D)          (None, 14, 14, 64)           32832     ['max_pooling2d_6[0][0]']     
                                                                                                  
 concatenate_3 (Concatenate  (None, 14, 14, 512)          0         ['conv2d_21[0][0]',           
 )                                                                   'conv2d_23[0][0]',           
                                                                     'conv2d_25[0][0]',           
                                                                     'conv2d_26[0][0]']           
                                                                                                  
 conv2d_28 (Conv2D)          (None, 14, 14, 128)          65664     ['concatenate_3[0][0]']       
                                                                                                  
 conv2d_30 (Conv2D)          (None, 14, 14, 24)           12312     ['concatenate_3[0][0]']       
                                                                                                  
 max_pooling2d_7 (MaxPoolin  (None, 14, 14, 512)          0         ['concatenate_3[0][0]']       
 g2D)                                                                                             
                                                                                                  
 conv2d_27 (Conv2D)          (None, 14, 14, 128)          65664     ['concatenate_3[0][0]']       
                                                                                                  
 conv2d_29 (Conv2D)          (None, 14, 14, 256)          295168    ['conv2d_28[0][0]']           
                                                                                                  
 conv2d_31 (Conv2D)          (None, 14, 14, 64)           38464     ['conv2d_30[0][0]']           
                                                                                                  
 conv2d_32 (Conv2D)          (None, 14, 14, 64)           32832     ['max_pooling2d_7[0][0]']     
                                                                                                  
 concatenate_4 (Concatenate  (None, 14, 14, 512)          0         ['conv2d_27[0][0]',           
 )                                                                   'conv2d_29[0][0]',           
                                                                     'conv2d_31[0][0]',           
                                                                     'conv2d_32[0][0]']           
                                                                                                  
 conv2d_34 (Conv2D)          (None, 14, 14, 144)          73872     ['concatenate_4[0][0]']       
                                                                                                  
 conv2d_36 (Conv2D)          (None, 14, 14, 32)           16416     ['concatenate_4[0][0]']       
                                                                                                  
 max_pooling2d_8 (MaxPoolin  (None, 14, 14, 512)          0         ['concatenate_4[0][0]']       
 g2D)                                                                                             
                                                                                                  
 conv2d_33 (Conv2D)          (None, 14, 14, 112)          57456     ['concatenate_4[0][0]']       
                                                                                                  
 conv2d_35 (Conv2D)          (None, 14, 14, 320)          415040    ['conv2d_34[0][0]']           
                                                                                                  
 conv2d_37 (Conv2D)          (None, 14, 14, 64)           51264     ['conv2d_36[0][0]']           
                                                                                                  
 conv2d_38 (Conv2D)          (None, 14, 14, 64)           32832     ['max_pooling2d_8[0][0]']     
                                                                                                  
 concatenate_5 (Concatenate  (None, 14, 14, 560)          0         ['conv2d_33[0][0]',           
 )                                                                   'conv2d_35[0][0]',           
                                                                     'conv2d_37[0][0]',           
                                                                     'conv2d_38[0][0]']           
                                                                                                  
 conv2d_40 (Conv2D)          (None, 14, 14, 160)          89760     ['concatenate_5[0][0]']       
                                                                                                  
 conv2d_42 (Conv2D)          (None, 14, 14, 32)           17952     ['concatenate_5[0][0]']       
                                                                                                  
 max_pooling2d_9 (MaxPoolin  (None, 14, 14, 560)          0         ['concatenate_5[0][0]']       
 g2D)                                                                                             
                                                                                                  
 conv2d_39 (Conv2D)          (None, 14, 14, 256)          143616    ['concatenate_5[0][0]']       
                                                                                                  
 conv2d_41 (Conv2D)          (None, 14, 14, 320)          461120    ['conv2d_40[0][0]']           
                                                                                                  
 conv2d_43 (Conv2D)          (None, 14, 14, 128)          102528    ['conv2d_42[0][0]']           
                                                                                                  
 conv2d_44 (Conv2D)          (None, 14, 14, 128)          71808     ['max_pooling2d_9[0][0]']     
                                                                                                  
 concatenate_6 (Concatenate  (None, 14, 14, 832)          0         ['conv2d_39[0][0]',           
 )                                                                   'conv2d_41[0][0]',           
                                                                     'conv2d_43[0][0]',           
                                                                     'conv2d_44[0][0]']           
                                                                                                  
 max_pooling2d_10 (MaxPooli  (None, 7, 7, 832)            0         ['concatenate_6[0][0]']       
 ng2D)                                                                                            
                                                                                                  
 conv2d_46 (Conv2D)          (None, 7, 7, 160)            133280    ['max_pooling2d_10[0][0]']    
                                                                                                  
 conv2d_48 (Conv2D)          (None, 7, 7, 32)             26656     ['max_pooling2d_10[0][0]']    
                                                                                                  
 max_pooling2d_11 (MaxPooli  (None, 7, 7, 832)            0         ['max_pooling2d_10[0][0]']    
 ng2D)                                                                                            
                                                                                                  
 conv2d_45 (Conv2D)          (None, 7, 7, 256)            213248    ['max_pooling2d_10[0][0]']    
                                                                                                  
 conv2d_47 (Conv2D)          (None, 7, 7, 320)            461120    ['conv2d_46[0][0]']           
                                                                                                  
 conv2d_49 (Conv2D)          (None, 7, 7, 128)            102528    ['conv2d_48[0][0]']           
                                                                                                  
 conv2d_50 (Conv2D)          (None, 7, 7, 128)            106624    ['max_pooling2d_11[0][0]']    
                                                                                                  
 concatenate_7 (Concatenate  (None, 7, 7, 832)            0         ['conv2d_45[0][0]',           
 )                                                                   'conv2d_47[0][0]',           
                                                                     'conv2d_49[0][0]',           
                                                                     'conv2d_50[0][0]']           
                                                                                                  
 conv2d_52 (Conv2D)          (None, 7, 7, 192)            159936    ['concatenate_7[0][0]']       
                                                                                                  
 conv2d_54 (Conv2D)          (None, 7, 7, 48)             39984     ['concatenate_7[0][0]']       
                                                                                                  
 max_pooling2d_12 (MaxPooli  (None, 7, 7, 832)            0         ['concatenate_7[0][0]']       
 ng2D)                                                                                            
                                                                                                  
 conv2d_51 (Conv2D)          (None, 7, 7, 384)            319872    ['concatenate_7[0][0]']       
                                                                                                  
 conv2d_53 (Conv2D)          (None, 7, 7, 384)            663936    ['conv2d_52[0][0]']           
                                                                                                  
 conv2d_55 (Conv2D)          (None, 7, 7, 128)            153728    ['conv2d_54[0][0]']           
                                                                                                  
 conv2d_56 (Conv2D)          (None, 7, 7, 128)            106624    ['max_pooling2d_12[0][0]']    
                                                                                                  
 concatenate_8 (Concatenate  (None, 7, 7, 1024)           0         ['conv2d_51[0][0]',           
 )                                                                   'conv2d_53[0][0]',           
                                                                     'conv2d_55[0][0]',           
                                                                     'conv2d_56[0][0]']           
                                                                                                  
 average_pooling2d (Average  (None, 1, 1, 1024)           0         ['concatenate_8[0][0]']       
 Pooling2D)                                                                                       
                                                                                                  
 flatten (Flatten)           (None, 1024)                 0         ['average_pooling2d[0][0]']   
                                                                                                  
 dropout (Dropout)           (None, 1024)                 0         ['flatten[0][0]']             
                                                                                                  
 dense (Dense)               (None, 1000)                 1025000   ['dropout[0][0]']             
                                                                                                  
==================================================================================================
Total params: 7058488 (26.93 MB)
Trainable params: 7058488 (26.93 MB)
Non-trainable params: 0 (0.00 Byte)
__________________________________________________________________________________________________
#+end_example

** ResNet
- Skip Connection
#+begin_src python :results output

import tensorflow as tf
from tensorflow import keras
from tensorflow.keras import Model
from tensorflow.keras.layers import Input, Conv2D, BatchNormalization, Activation, Add, AveragePooling2D, Dense

def resnet_module(x, kernel_size, channels, stride=1):
    x_shortcut=x

    if stride>1:
        x_shortcut=Conv2D(channels, (1, 1),
                          strides=stride, padding="same")(x_shortcut)
        x_shortcut=BatchNormalization(axis=3)(x_shortcut)

    x=Conv2D(channels, kernel_size=kernel_size,
             strides=stride, padding="same")(x)
    x=BatchNormalization(axis=3)(x)
    x=Activation("relu")(x)
    x=Conv2D(channels, kernel_size=kernel_size,
             strides=(1, 1), padding="same")(x)
    x=BatchNormalization(axis=3)(x)
    x=Add()([x, x_shortcut])
    x=Activation("relu")(x)
    return x

if __name__ == "__main__":
    input=Input(shape=(224, 224, 3))
    x=Conv2D(64, (7, 7),
             strides=(2, 2), padding="same")(input)
    x=BatchNormalization(axis=3)(x)
    x=Activation("relu")(x)

    for i in range(3): x=resnet_module(x, (3, 3), 64, 1)

    x=resnet_module(x, (3, 3), 128, 2)

    for i in range(3): x=resnet_module(x, (3, 3), 128, 1)

    x=resnet_module(x, (3, 3), 256, 2)

    for i in range(5): x=resnet_module(x, (3, 3), 256, 1)

    x=resnet_module(x, (3, 3), 512, 2)

    for i in range(2): x=resnet_module(x, (3, 3), 512, 1)

    x=AveragePooling2D(pool_size=(7, 7), strides=7, padding="same")(x)
    output=Dense(1000, activation="softmax",
                 kernel_initializer="glorot_uniform",
                 bias_initializer="zeros")(x)
    
    model=Model(inputs=input, outputs=output, name="ResNet-34")
    model.summary()

#+end_src

#+RESULTS:
#+begin_example
Model: "ResNet-34"
__________________________________________________________________________________________________
 Layer (type)                Output Shape                 Param #   Connected to                  
==================================================================================================
 input_1 (InputLayer)        [(None, 224, 224, 3)]        0         []                            
                                                                                                  
 conv2d (Conv2D)             (None, 112, 112, 64)         9472      ['input_1[0][0]']             
                                                                                                  
 batch_normalization (Batch  (None, 112, 112, 64)         256       ['conv2d[0][0]']              
 Normalization)                                                                                   
                                                                                                  
 activation (Activation)     (None, 112, 112, 64)         0         ['batch_normalization[0][0]'] 
                                                                                                  
 conv2d_1 (Conv2D)           (None, 112, 112, 64)         36928     ['activation[0][0]']          
                                                                                                  
 batch_normalization_1 (Bat  (None, 112, 112, 64)         256       ['conv2d_1[0][0]']            
 chNormalization)                                                                                 
                                                                                                  
 activation_1 (Activation)   (None, 112, 112, 64)         0         ['batch_normalization_1[0][0]'
                                                                    ]                             
                                                                                                  
 conv2d_2 (Conv2D)           (None, 112, 112, 64)         36928     ['activation_1[0][0]']        
                                                                                                  
 batch_normalization_2 (Bat  (None, 112, 112, 64)         256       ['conv2d_2[0][0]']            
 chNormalization)                                                                                 
                                                                                                  
 add (Add)                   (None, 112, 112, 64)         0         ['batch_normalization_2[0][0]'
                                                                    , 'activation[0][0]']         
                                                                                                  
 activation_2 (Activation)   (None, 112, 112, 64)         0         ['add[0][0]']                 
                                                                                                  
 conv2d_3 (Conv2D)           (None, 112, 112, 64)         36928     ['activation_2[0][0]']        
                                                                                                  
 batch_normalization_3 (Bat  (None, 112, 112, 64)         256       ['conv2d_3[0][0]']            
 chNormalization)                                                                                 
                                                                                                  
 activation_3 (Activation)   (None, 112, 112, 64)         0         ['batch_normalization_3[0][0]'
                                                                    ]                             
                                                                                                  
 conv2d_4 (Conv2D)           (None, 112, 112, 64)         36928     ['activation_3[0][0]']        
                                                                                                  
 batch_normalization_4 (Bat  (None, 112, 112, 64)         256       ['conv2d_4[0][0]']            
 chNormalization)                                                                                 
                                                                                                  
 add_1 (Add)                 (None, 112, 112, 64)         0         ['batch_normalization_4[0][0]'
                                                                    , 'activation_2[0][0]']       
                                                                                                  
 activation_4 (Activation)   (None, 112, 112, 64)         0         ['add_1[0][0]']               
                                                                                                  
 conv2d_5 (Conv2D)           (None, 112, 112, 64)         36928     ['activation_4[0][0]']        
                                                                                                  
 batch_normalization_5 (Bat  (None, 112, 112, 64)         256       ['conv2d_5[0][0]']            
 chNormalization)                                                                                 
                                                                                                  
 activation_5 (Activation)   (None, 112, 112, 64)         0         ['batch_normalization_5[0][0]'
                                                                    ]                             
                                                                                                  
 conv2d_6 (Conv2D)           (None, 112, 112, 64)         36928     ['activation_5[0][0]']        
                                                                                                  
 batch_normalization_6 (Bat  (None, 112, 112, 64)         256       ['conv2d_6[0][0]']            
 chNormalization)                                                                                 
                                                                                                  
 add_2 (Add)                 (None, 112, 112, 64)         0         ['batch_normalization_6[0][0]'
                                                                    , 'activation_4[0][0]']       
                                                                                                  
 activation_6 (Activation)   (None, 112, 112, 64)         0         ['add_2[0][0]']               
                                                                                                  
 conv2d_8 (Conv2D)           (None, 56, 56, 128)          73856     ['activation_6[0][0]']        
                                                                                                  
 batch_normalization_8 (Bat  (None, 56, 56, 128)          512       ['conv2d_8[0][0]']            
 chNormalization)                                                                                 
                                                                                                  
 activation_7 (Activation)   (None, 56, 56, 128)          0         ['batch_normalization_8[0][0]'
                                                                    ]                             
                                                                                                  
 conv2d_9 (Conv2D)           (None, 56, 56, 128)          147584    ['activation_7[0][0]']        
                                                                                                  
 conv2d_7 (Conv2D)           (None, 56, 56, 128)          8320      ['activation_6[0][0]']        
                                                                                                  
 batch_normalization_9 (Bat  (None, 56, 56, 128)          512       ['conv2d_9[0][0]']            
 chNormalization)                                                                                 
                                                                                                  
 batch_normalization_7 (Bat  (None, 56, 56, 128)          512       ['conv2d_7[0][0]']            
 chNormalization)                                                                                 
                                                                                                  
 add_3 (Add)                 (None, 56, 56, 128)          0         ['batch_normalization_9[0][0]'
                                                                    , 'batch_normalization_7[0][0]
                                                                    ']                            
                                                                                                  
 activation_8 (Activation)   (None, 56, 56, 128)          0         ['add_3[0][0]']               
                                                                                                  
 conv2d_10 (Conv2D)          (None, 56, 56, 128)          147584    ['activation_8[0][0]']        
                                                                                                  
 batch_normalization_10 (Ba  (None, 56, 56, 128)          512       ['conv2d_10[0][0]']           
 tchNormalization)                                                                                
                                                                                                  
 activation_9 (Activation)   (None, 56, 56, 128)          0         ['batch_normalization_10[0][0]
                                                                    ']                            
                                                                                                  
 conv2d_11 (Conv2D)          (None, 56, 56, 128)          147584    ['activation_9[0][0]']        
                                                                                                  
 batch_normalization_11 (Ba  (None, 56, 56, 128)          512       ['conv2d_11[0][0]']           
 tchNormalization)                                                                                
                                                                                                  
 add_4 (Add)                 (None, 56, 56, 128)          0         ['batch_normalization_11[0][0]
                                                                    ',                            
                                                                     'activation_8[0][0]']        
                                                                                                  
 activation_10 (Activation)  (None, 56, 56, 128)          0         ['add_4[0][0]']               
                                                                                                  
 conv2d_12 (Conv2D)          (None, 56, 56, 128)          147584    ['activation_10[0][0]']       
                                                                                                  
 batch_normalization_12 (Ba  (None, 56, 56, 128)          512       ['conv2d_12[0][0]']           
 tchNormalization)                                                                                
                                                                                                  
 activation_11 (Activation)  (None, 56, 56, 128)          0         ['batch_normalization_12[0][0]
                                                                    ']                            
                                                                                                  
 conv2d_13 (Conv2D)          (None, 56, 56, 128)          147584    ['activation_11[0][0]']       
                                                                                                  
 batch_normalization_13 (Ba  (None, 56, 56, 128)          512       ['conv2d_13[0][0]']           
 tchNormalization)                                                                                
                                                                                                  
 add_5 (Add)                 (None, 56, 56, 128)          0         ['batch_normalization_13[0][0]
                                                                    ',                            
                                                                     'activation_10[0][0]']       
                                                                                                  
 activation_12 (Activation)  (None, 56, 56, 128)          0         ['add_5[0][0]']               
                                                                                                  
 conv2d_14 (Conv2D)          (None, 56, 56, 128)          147584    ['activation_12[0][0]']       
                                                                                                  
 batch_normalization_14 (Ba  (None, 56, 56, 128)          512       ['conv2d_14[0][0]']           
 tchNormalization)                                                                                
                                                                                                  
 activation_13 (Activation)  (None, 56, 56, 128)          0         ['batch_normalization_14[0][0]
                                                                    ']                            
                                                                                                  
 conv2d_15 (Conv2D)          (None, 56, 56, 128)          147584    ['activation_13[0][0]']       
                                                                                                  
 batch_normalization_15 (Ba  (None, 56, 56, 128)          512       ['conv2d_15[0][0]']           
 tchNormalization)                                                                                
                                                                                                  
 add_6 (Add)                 (None, 56, 56, 128)          0         ['batch_normalization_15[0][0]
                                                                    ',                            
                                                                     'activation_12[0][0]']       
                                                                                                  
 activation_14 (Activation)  (None, 56, 56, 128)          0         ['add_6[0][0]']               
                                                                                                  
 conv2d_17 (Conv2D)          (None, 28, 28, 256)          295168    ['activation_14[0][0]']       
                                                                                                  
 batch_normalization_17 (Ba  (None, 28, 28, 256)          1024      ['conv2d_17[0][0]']           
 tchNormalization)                                                                                
                                                                                                  
 activation_15 (Activation)  (None, 28, 28, 256)          0         ['batch_normalization_17[0][0]
                                                                    ']                            
                                                                                                  
 conv2d_18 (Conv2D)          (None, 28, 28, 256)          590080    ['activation_15[0][0]']       
                                                                                                  
 conv2d_16 (Conv2D)          (None, 28, 28, 256)          33024     ['activation_14[0][0]']       
                                                                                                  
 batch_normalization_18 (Ba  (None, 28, 28, 256)          1024      ['conv2d_18[0][0]']           
 tchNormalization)                                                                                
                                                                                                  
 batch_normalization_16 (Ba  (None, 28, 28, 256)          1024      ['conv2d_16[0][0]']           
 tchNormalization)                                                                                
                                                                                                  
 add_7 (Add)                 (None, 28, 28, 256)          0         ['batch_normalization_18[0][0]
                                                                    ',                            
                                                                     'batch_normalization_16[0][0]
                                                                    ']                            
                                                                                                  
 activation_16 (Activation)  (None, 28, 28, 256)          0         ['add_7[0][0]']               
                                                                                                  
 conv2d_19 (Conv2D)          (None, 28, 28, 256)          590080    ['activation_16[0][0]']       
                                                                                                  
 batch_normalization_19 (Ba  (None, 28, 28, 256)          1024      ['conv2d_19[0][0]']           
 tchNormalization)                                                                                
                                                                                                  
 activation_17 (Activation)  (None, 28, 28, 256)          0         ['batch_normalization_19[0][0]
                                                                    ']                            
                                                                                                  
 conv2d_20 (Conv2D)          (None, 28, 28, 256)          590080    ['activation_17[0][0]']       
                                                                                                  
 batch_normalization_20 (Ba  (None, 28, 28, 256)          1024      ['conv2d_20[0][0]']           
 tchNormalization)                                                                                
                                                                                                  
 add_8 (Add)                 (None, 28, 28, 256)          0         ['batch_normalization_20[0][0]
                                                                    ',                            
                                                                     'activation_16[0][0]']       
                                                                                                  
 activation_18 (Activation)  (None, 28, 28, 256)          0         ['add_8[0][0]']               
                                                                                                  
 conv2d_21 (Conv2D)          (None, 28, 28, 256)          590080    ['activation_18[0][0]']       
                                                                                                  
 batch_normalization_21 (Ba  (None, 28, 28, 256)          1024      ['conv2d_21[0][0]']           
 tchNormalization)                                                                                
                                                                                                  
 activation_19 (Activation)  (None, 28, 28, 256)          0         ['batch_normalization_21[0][0]
                                                                    ']                            
                                                                                                  
 conv2d_22 (Conv2D)          (None, 28, 28, 256)          590080    ['activation_19[0][0]']       
                                                                                                  
 batch_normalization_22 (Ba  (None, 28, 28, 256)          1024      ['conv2d_22[0][0]']           
 tchNormalization)                                                                                
                                                                                                  
 add_9 (Add)                 (None, 28, 28, 256)          0         ['batch_normalization_22[0][0]
                                                                    ',                            
                                                                     'activation_18[0][0]']       
                                                                                                  
 activation_20 (Activation)  (None, 28, 28, 256)          0         ['add_9[0][0]']               
                                                                                                  
 conv2d_23 (Conv2D)          (None, 28, 28, 256)          590080    ['activation_20[0][0]']       
                                                                                                  
 batch_normalization_23 (Ba  (None, 28, 28, 256)          1024      ['conv2d_23[0][0]']           
 tchNormalization)                                                                                
                                                                                                  
 activation_21 (Activation)  (None, 28, 28, 256)          0         ['batch_normalization_23[0][0]
                                                                    ']                            
                                                                                                  
 conv2d_24 (Conv2D)          (None, 28, 28, 256)          590080    ['activation_21[0][0]']       
                                                                                                  
 batch_normalization_24 (Ba  (None, 28, 28, 256)          1024      ['conv2d_24[0][0]']           
 tchNormalization)                                                                                
                                                                                                  
 add_10 (Add)                (None, 28, 28, 256)          0         ['batch_normalization_24[0][0]
                                                                    ',                            
                                                                     'activation_20[0][0]']       
                                                                                                  
 activation_22 (Activation)  (None, 28, 28, 256)          0         ['add_10[0][0]']              
                                                                                                  
 conv2d_25 (Conv2D)          (None, 28, 28, 256)          590080    ['activation_22[0][0]']       
                                                                                                  
 batch_normalization_25 (Ba  (None, 28, 28, 256)          1024      ['conv2d_25[0][0]']           
 tchNormalization)                                                                                
                                                                                                  
 activation_23 (Activation)  (None, 28, 28, 256)          0         ['batch_normalization_25[0][0]
                                                                    ']                            
                                                                                                  
 conv2d_26 (Conv2D)          (None, 28, 28, 256)          590080    ['activation_23[0][0]']       
                                                                                                  
 batch_normalization_26 (Ba  (None, 28, 28, 256)          1024      ['conv2d_26[0][0]']           
 tchNormalization)                                                                                
                                                                                                  
 add_11 (Add)                (None, 28, 28, 256)          0         ['batch_normalization_26[0][0]
                                                                    ',                            
                                                                     'activation_22[0][0]']       
                                                                                                  
 activation_24 (Activation)  (None, 28, 28, 256)          0         ['add_11[0][0]']              
                                                                                                  
 conv2d_27 (Conv2D)          (None, 28, 28, 256)          590080    ['activation_24[0][0]']       
                                                                                                  
 batch_normalization_27 (Ba  (None, 28, 28, 256)          1024      ['conv2d_27[0][0]']           
 tchNormalization)                                                                                
                                                                                                  
 activation_25 (Activation)  (None, 28, 28, 256)          0         ['batch_normalization_27[0][0]
                                                                    ']                            
                                                                                                  
 conv2d_28 (Conv2D)          (None, 28, 28, 256)          590080    ['activation_25[0][0]']       
                                                                                                  
 batch_normalization_28 (Ba  (None, 28, 28, 256)          1024      ['conv2d_28[0][0]']           
 tchNormalization)                                                                                
                                                                                                  
 add_12 (Add)                (None, 28, 28, 256)          0         ['batch_normalization_28[0][0]
                                                                    ',                            
                                                                     'activation_24[0][0]']       
                                                                                                  
 activation_26 (Activation)  (None, 28, 28, 256)          0         ['add_12[0][0]']              
                                                                                                  
 conv2d_30 (Conv2D)          (None, 14, 14, 512)          1180160   ['activation_26[0][0]']       
                                                                                                  
 batch_normalization_30 (Ba  (None, 14, 14, 512)          2048      ['conv2d_30[0][0]']           
 tchNormalization)                                                                                
                                                                                                  
 activation_27 (Activation)  (None, 14, 14, 512)          0         ['batch_normalization_30[0][0]
                                                                    ']                            
                                                                                                  
 conv2d_31 (Conv2D)          (None, 14, 14, 512)          2359808   ['activation_27[0][0]']       
                                                                                                  
 conv2d_29 (Conv2D)          (None, 14, 14, 512)          131584    ['activation_26[0][0]']       
                                                                                                  
 batch_normalization_31 (Ba  (None, 14, 14, 512)          2048      ['conv2d_31[0][0]']           
 tchNormalization)                                                                                
                                                                                                  
 batch_normalization_29 (Ba  (None, 14, 14, 512)          2048      ['conv2d_29[0][0]']           
 tchNormalization)                                                                                
                                                                                                  
 add_13 (Add)                (None, 14, 14, 512)          0         ['batch_normalization_31[0][0]
                                                                    ',                            
                                                                     'batch_normalization_29[0][0]
                                                                    ']                            
                                                                                                  
 activation_28 (Activation)  (None, 14, 14, 512)          0         ['add_13[0][0]']              
                                                                                                  
 conv2d_32 (Conv2D)          (None, 14, 14, 512)          2359808   ['activation_28[0][0]']       
                                                                                                  
 batch_normalization_32 (Ba  (None, 14, 14, 512)          2048      ['conv2d_32[0][0]']           
 tchNormalization)                                                                                
                                                                                                  
 activation_29 (Activation)  (None, 14, 14, 512)          0         ['batch_normalization_32[0][0]
                                                                    ']                            
                                                                                                  
 conv2d_33 (Conv2D)          (None, 14, 14, 512)          2359808   ['activation_29[0][0]']       
                                                                                                  
 batch_normalization_33 (Ba  (None, 14, 14, 512)          2048      ['conv2d_33[0][0]']           
 tchNormalization)                                                                                
                                                                                                  
 add_14 (Add)                (None, 14, 14, 512)          0         ['batch_normalization_33[0][0]
                                                                    ',                            
                                                                     'activation_28[0][0]']       
                                                                                                  
 activation_30 (Activation)  (None, 14, 14, 512)          0         ['add_14[0][0]']              
                                                                                                  
 conv2d_34 (Conv2D)          (None, 14, 14, 512)          2359808   ['activation_30[0][0]']       
                                                                                                  
 batch_normalization_34 (Ba  (None, 14, 14, 512)          2048      ['conv2d_34[0][0]']           
 tchNormalization)                                                                                
                                                                                                  
 activation_31 (Activation)  (None, 14, 14, 512)          0         ['batch_normalization_34[0][0]
                                                                    ']                            
                                                                                                  
 conv2d_35 (Conv2D)          (None, 14, 14, 512)          2359808   ['activation_31[0][0]']       
                                                                                                  
 batch_normalization_35 (Ba  (None, 14, 14, 512)          2048      ['conv2d_35[0][0]']           
 tchNormalization)                                                                                
                                                                                                  
 add_15 (Add)                (None, 14, 14, 512)          0         ['batch_normalization_35[0][0]
                                                                    ',                            
                                                                     'activation_30[0][0]']       
                                                                                                  
 activation_32 (Activation)  (None, 14, 14, 512)          0         ['add_15[0][0]']              
                                                                                                  
 average_pooling2d (Average  (None, 2, 2, 512)            0         ['activation_32[0][0]']       
 Pooling2D)                                                                                       
                                                                                                  
 dense (Dense)               (None, 2, 2, 1000)           513000    ['average_pooling2d[0][0]']   
                                                                                                  
==================================================================================================
Total params: 21823208 (83.25 MB)
Trainable params: 21806184 (83.18 MB)
Non-trainable params: 17024 (66.50 KB)
__________________________________________________________________________________________________
#+end_example

*** ResNet Keras Application
#+begin_src python :results output

import numpy as np
from tensorflow.keras.applications import resnet50
from tensorflow.keras.preprocessing.image import load_img
from tensorflow.keras.preprocessing.image import img_to_array
from tensorflow.keras.applications.resnet50 import decode_predictions
import matplotlib.pyplot as plt
import tensorflow as tf
import logging

tf.get_logger().setLevel(logging.ERROR)
image=load_img("../data/ResNet/dog.jpg", target_size=(224, 224))
image_np=img_to_array(image)
image_np=np.expand_dims(image_np, axis=0)

model=resnet50.ResNet50(weights="imagenet")
x=resnet50.preprocess_input(image_np.copy())
y=model.predict(x)
predicted_labels=decode_predictions(y)
print("predictions = ", predicted_labels)

plt.imshow(np.uint8(image_np[0]))
plt.show()

#+end_src

#+RESULTS:
: Downloading data from https://storage.googleapis.com/tensorflow/keras-applications/resnet/resnet50_weights_tf_dim_ordering_tf_kernels.h5
: 8192/102967424 [..............................] - ETA: 0s 102967424/102967424 [==============================] - 9s 0us/step
: 1/1 [==============================] - ETA: 0s 1/1 [==============================] - 1s 531ms/step
: Downloading data from https://storage.googleapis.com/download.tensorflow.org/data/imagenet_class_index.json
: 8192/35363 [=====>........................] - ETA: 0s 35363/35363 [==============================] - 0s 0us/step
: predictions =  [[('n02091134', 'whippet', 0.5135991), ('n02085620', 'Chihuahua', 0.05966966), ('n02111889', 'Samoyed', 0.049631666), ('n02109961', 'Eskimo_dog', 0.04578995), ('n02115641', 'dingo', 0.02609167)]]

** EffecientNet
- Depthwise Separable Convolution
#+begin_src python :results output

import tensorflow as tf
from tensorflow import keras
from tensorflow.keras import Model
from tensorflow.keras.layers import Input, DepthwiseConv2D, Conv2D

inputs=Input(shape=(32, 32, 3))
outputs1=Conv2D(64, (3, 3), activation="relu",
                padding="valid")(inputs)

# depthwise
outputs2=DepthwiseConv2D(kernel_size=(3, 3), activation="relu",
                         padding="valid")(inputs)
# pointwise
outputs2=Conv2D(64, (1, 1), activation="relu")(outputs2)

model1=Model(inputs, outputs1)
model2=Model(inputs, outputs2)

model1.summary()
model2.summary()

#+end_src

#+RESULTS:
#+begin_example
Model: "model"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 input_1 (InputLayer)        [(None, 32, 32, 3)]       0         
                                                                 
 conv2d (Conv2D)             (None, 30, 30, 64)        1792      
                                                                 
=================================================================
Total params: 1792 (7.00 KB)
Trainable params: 1792 (7.00 KB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________
Model: "model_1"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 input_1 (InputLayer)        [(None, 32, 32, 3)]       0         
                                                                 
 depthwise_conv2d (Depthwis  (None, 30, 30, 3)         30        
 eConv2D)                                                        
                                                                 
 conv2d_1 (Conv2D)           (None, 30, 30, 64)        256       
                                                                 
=================================================================
Total params: 286 (1.12 KB)
Trainable params: 286 (1.12 KB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________
#+end_example
